[
    {
        "room_id": "town_square", 
        "name": "The Great Town Square", 
        "description": {
            "default": "A bustling place with a magnificent fountain in the center. Paths lead in all directions, and a stone well stands near the eastern corner.",
            
            "DAWN": {
                "clear": "The first faint light of dawn breaks, painting the sky in hues of orange and pink. The fountain is still, its water like glass. A few early risers are beginning to move about.",
                "light clouds": "A pale, grey light filters through the high, thin clouds of dawn. The air is cool and still, and the square is quiet.",
                "overcast": "A heavy, grey ceiling of clouds robs the dawn of its color, plunging the square into a dim, oppressive light. The fountain is a dark shape in the center.",
                "fog": "A thick, cold fog clings to the ground, obscuring the cobblestones. The dawn light struggles to pierce the mist, and the fountain is only a faint sound of dripping water.",
                "light rain": "A chilly, light rain patters on the stones as dawn breaks. The square is empty, its surfaces slick and reflective in the dim light.",
                "rain": "Dawn arrives with a steady, drenching rain. The sound of the downpour drowns out all else, and the fountain's basin is already overflowing.",
                "heavy rain": "A torrential downpour greets the dawn. The square is a churning mass of water, and the well near the eastern corner looks precariously full.",
                "storm": "Dawn is heralded by a flash of lightning and a crack of thunder. The storm rages, making the square a dangerous, windswept place."
            },
            "MORNING": {
                "clear": "The bright morning sun warms the cobblestones. The square is bustling with merchants setting up stalls and townsfolk going about their day. The fountain sparkles brightly.",
                "light clouds": "Wispy clouds drift across the morning sky, offering brief moments of shade. The square is busy, filled with the sounds of commerce and conversation.",
                "overcast": "A flat, grey overcast sky dulls the morning. The square is busy, but the mood is subdued under the shadowless light. The fountain's spray seems less vibrant.",
                "fog": "The morning fog lingers, reducing visibility to a few dozen feet. Shapes move through the mist, and the fountain's splashing sounds strangely close.",
                "light rain": "A persistent light rain dampens the square. People huddle under awnings, and the fountain's spray is lost in the general drizzle.",
                "rain": "A steady rain falls, clearing the square of all but the most determined. The cobblestones are slick, and the well is surrounded by puddles.",
                "heavy rain": "Heavy rain hammers the square, sending everyone running for cover. The fountain is a churning mass, its spray indistinguishable from the rain.",
                "storm": "The morning storm continues to rage. Lightning flashes intermittently, and the well near the eastern corner looks dangerously full."
            },
            "NOON": {
                "clear": "The sun hangs high overhead, beating down on the square. It's the peak of the day, and the fountain's mist is a welcome relief from the heat.",
                "light clouds": "A few fluffy clouds offer little relief from the high sun. The square is active, though many seek the shade of the buildings.",
                "overcast": "A thick blanket of clouds makes noon feel like late afternoon. The light is flat and grey, and the fountain's water seems dark.",
                "fog": "It is bizarre to have fog at noon. The thick, damp air is disorienting, and the sun is just a faint, white disc somewhere above.",
                "light rain": "A warm, light rain falls from the sky. The square is less crowded, and the air smells of wet stone and ozone.",
                "rain": "The steady rain at noon has driven most indoors. The square is quiet, save for the drumming of the rain and the splash of the fountain.",
                "heavy rain": "A torrential downpour at midday. The square is flooded, and the fountain's basin is completely overwhelmed by the deluge.",
                "storm": "A violent thunderstorm rages at noon. The sky is nearly as dark as night, lit only by flashes of lightning."
            },
            "AFTERNOON": {
                "clear": "The late afternoon sun casts long shadows across the square. The magnificent fountain's shadow stretches eastward, nearly touching the stone well.",
                "light clouds": "The afternoon sun breaks through scattered clouds, dappling the square in light and shadow. The fountain's shadow grows long, creeping toward the well.",
                "overcast": "The overcast sky of the afternoon creates a dim, shadowless light. The day feels like it's ending prematurely.",
                "fog": "A strange afternoon fog has rolled in, swallowing the square. The long shadows of the day are lost in the oppressive, grey mist.",
                "light rain": "A light rain continues into the afternoon. The fountain's shadow is invisible, and the square is slick with water.",
                "rain": "Rain drums steadily on the cobblestones. The fountain's long afternoon shadow is completely obscured by the downpour.",
                "heavy rain": "Heavy rain lashes the square. The long shadow of the fountain is a concept lost to the driving sheets of water.",
                "storm": "A fierce afternoon storm darkens the sky. The fountain's shadow is non-existent as lightning illuminates the square."
            },
            "DUSK": {
                "clear": "The sun dips below the horizon, painting the sky in fiery colors. The first lamps are being lit, and the fountain's water glows in the twilight.",
                "light clouds": "The clouds on the horizon are tinged with the red and purple of sunset. The square grows quiet as people head home for the evening.",
                "overcast": "The overcast sky turns a bruised purple as dusk settles. The square becomes dark quickly, and the fountain is a gloomy silhouette.",
                "fog": "The fog thickens as dusk falls, mixing with the growing shadows. The square is eerie and silent, the fountain's splashing muffled and close.",
                "light rain": "A cool, light rain falls in the twilight. The few lamps that are lit cast shimmering reflections on the wet cobblestones.",
                "rain": "Rain continues to fall as darkness settles. The square is deserted, and the fountain is a noisy, wet presence in the gloom.",
                "heavy rain": "It is dark and storming. The heavy rain at dusk is relentless, and the square is a hazardous, flooded place.",
                "storm": "Dusk is swallowed by the storm. It is pitch black, save for the flashes of lightning that reveal the rain-swept, empty square."
            },
            "EVENING": {
                "clear": "The sky is clear and filled with stars. Lamps around the square cast pools of warm light, and the fountain murmurs peacefully in the cool night air.",
                "light clouds": "Thin clouds scud across the moon. The square is quiet, with only a few people moving through the lamplit shadows.",
                "overcast": "A low, dark ceiling of clouds blocks all starlight, making the square feel claustrophobic. The lamps seem to struggle against the oppressive dark.",
                "fog": "The night fog is thick and cold. The lamps cast hazy, isolated glows, and the fountain is an invisible source of splashing in the dark.",
                "light rain": "A light rain mists through the lamplit air. The square is empty, its stones glistening wetly.",
                "rain": "A steady rain falls on the dark square. The sound is soothing, but the air is cold and damp.",
                "heavy rain": "Heavy rain hammers the dark, empty square. The fountain is a roaring, churning mass in the center of the deluge.",
                "storm": "A thunderstorm rages in the dead of night. The square is lit in stark, terrifying flashes of white, revealing the stone well and the thrashing fountain."
            },
            "NIGHT": {
                "clear": "The world is dark, lit only by a clear, starry sky and the moon. The square is silent, and the fountain's water shimmers under the moonlight.",
                "light clouds": "Thin clouds drift past the moon, casting fleeting shadows over the dark square. The fountain murmurs quietly.",
                "overcast": "The sky is a black, featureless void. The square is plunged into deep darkness, and the fountain is just a sound in the night.",
                "fog": "A thick, cold fog blankets the square. It's impossible to see more than a few feet, and the stone well is completely hidden in the mist.",
                "light rain": "A cold, light rain falls from the black sky. The square is silent, save for the patter of the rain and the splash of the fountain.",
                "rain": "A steady, cold rain falls on the deserted square. Puddles are forming around the well, and the fountain sounds loud in the silence.",
                "heavy rain": "A drenching, heavy rain pours down, flooding the square in the dead of night. The sound is a deafening roar.",
                "storm": "A fierce storm rages in the darkness. The square is a chaotic place of wind, rain, and the occasional, blinding flash of lightning."
            },
            "MIDNIGHT": {
                "clear": "The hour of midnight passes. The moon is high, casting stark, pale shadows across the silent square. The fountain's water glitters like silver.",
                "light clouds": "The moon is hidden behind passing clouds, plunging the square into darkness before reappearing. The air is still and cold.",
                "overcast": "It is pitch black at midnight. The overcast sky blocks all light, and the square is an oppressive, silent void.",
                "fog": "A thick, icy fog blankets the square at midnight. The world is reduced to a few feet of visibility, and a sense of isolation is total.",
                "light rain": "A cold, miserable drizzle falls at midnight. The square is empty and dark, the sound of the rain barely audible.",
                "rain": "A steady rain drums on the cobblestones in the pitch dark. The fountain's splashing is a lonely sound.",
                "heavy rain": "A torrential downpour rages at midnight. The square is flooded, and the sound is a deafening, chaotic roar.",
                "storm": "The storm reaches its peak at midnight. Lightning flashes reveal the square being torn apart by wind and rain. The fountain is a white, churning mass."
            }
        },
        "unabsorbed_social_exp": 100,
        "is_outdoor": true,
        "objects": [ 
            {
                "name": "fountain", 
                "description": "The fountain depicts the Goddess of Wealth pouring endless gold into the city. Its water is cool and clear.",
                "perception_dc": 0,
                "keywords": ["fountain"],
                "details": [
                    {
                        "name": "water",
                        "description": "Looking closely at the water, you see a few copper coins glinting at the bottom.",
                        "skill_check": "LOG",
                        "dc": 50
                    }
                ]
            },
            {
                "name": "well", 
                "description": "A weathered stone well. You can see a dark, winding rope tied to the lip, leading down. You could probably **CLIMB** the rope.", 
                "verbs": ["CLIMB"], 
                "target_room": "well_bottom",
                "perception_dc": 0,
                "keywords": ["well", "stone well"]
            },
            {
                "name": "a grizzled warrior",
                "description": "A grizzled old warrior paces the square, his eyes scanning for... something. He carries a long spear.",
                "verbs": ["look", "attack", "talk"],
                "is_monster": true,
                "is_npc": true,
                "monster_id": "grizzled_warrior",
                "keywords": ["warrior", "grizzled warrior", "a grizzled warrior"],
                "quest_giver_ids": ["trip_quest_1"]
            }
        ],
        "exits": {
            "north": "ts_north", "south": "ts_south", "east": "ts_east", "west": "ts_west",
            "northeast": "ts_northeast", "northwest": "ts_northwest", "southeast": "ts_southeast", "southwest": "ts_southwest"
        }
    },
    {
        "room_id": "ts_south", 
        "name": "South Square", 
        "is_outdoor": true,
        "description": {
            "default": "You are in the southern part of the town square. The main square is to the north. The sturdy wooden door to the inn is here."
        },
        "exits": {"north": "town_square", "east": "ts_southeast", "west": "ts_southwest"}, 
        "objects": [
            {
                "name": "door", 
                "description": "The sturdy wooden door to the inn. You could probably **ENTER** it.", 
                "verbs": ["ENTER"], 
                "target_room": "inn_room",
                "perception_dc": 0,
                "keywords": ["door", "wooden door", "inn"]
            }
        ]
    },
    {
        "room_id": "well_bottom", 
        "name": "The Bottom of the Well", 
        "description": {
            "default": "It is dark and cramped down here. The air is damp and smells of mildew and wet fur. You notice some strange plants growing in the muck near the wall. Dark passages lead east and west."
        },
        "objects": [
            {
                "name": "rope", 
                "description": "A thick, wet rope leads back up to the town square.", 
                "verbs": ["CLIMB"], 
                "target_room": "town_square",
                "perception_dc": 0,
                "keywords": ["rope"],
                "details": [
                    {
                        "name": "rope-fray",
                        "description": "Upon closer inspection, you see the rope is badly frayed near the top, as if from a sharp edge. It might not hold forever.",
                        "skill_check": "LOG",
                        "dc": 60
                    }
                ]
            },
            {
                "name": "stirring monster",
                "description": "A mass of shadows and wet fur, it huffs angrily.",
                "verbs": ["look", "attack"],
                "perception_dc": 15,
                "is_monster": true,
                "monster_id": "well_bottom_stirring_monster"
            }
        ],
        "exits": {
            "east": "cave_east",
            "west": "cave_west"
        },
        "forageable_items": [
            { "item_id": "viridian_leaf", "item_name": "viridian leaf", "dc": 50 },
            { "item_id": "althion_stem", "item_name": "althion stem", "dc": 85 }
        ]
    },
    {
        "room_id": "cave_east",
        "name": "A Dark Cave",
        "description": {
            "default": "The damp, mildewy smell from the well intensifies here. The darkness is oppressive, and you hear a faint skittering noise from deeper in."
        },
        "objects": [
            {
                "name": "stirring monster",
                "description": "A mass of shadows and wet fur, it huffs angrily.",
                "verbs": ["look", "attack"],
                "perception_dc": 15,
                "is_monster": true,
                "monster_id": "well_bottom_stirring_monster"
            }
        ],
        "exits": { "west": "well_bottom" }
    },
    {
        "room_id": "cave_west",
        "name": "A Dark Cave",
        "description": {
            "default": "The damp, mildewy smell from the well intensifies here. The darkness is oppressive, and you hear a faint skittering noise from deeper in."
        },
        "objects": [
            {
                "name": "stirring monster",
                "description": "A mass of shadows and wet fur, it huffs angrily.",
                "verbs": ["look", "attack"],
                "perception_dc": 15,
                "is_monster": true,
                "monster_id": "well_bottom_stirring_monster"
            }
        ],
        "exits": { "east": "well_bottom" }
    },
    
    {
        "room_id": "ts_north", 
        "name": "North Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the northern part of the town square. The main square is to the south. A well-worn path continues to the north, leading to the city's edge."
        }, 
        "exits": {
            "south": "town_square", 
            "east": "ts_northeast", 
            "west": "ts_northwest",
            "north": "north_gate"
        }
    },
    
    {
        "room_id": "ts_east", 
        "name": "East Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the eastern part of the town square. The main square is to the west. A set of tall, oaken doors stand here, open to the public."
        },
        "exits": {"west": "town_square", "north": "ts_northeast", "south": "ts_southeast"}, 
        "objects": [
            {
                "name": "oaken doors", 
                "description": "Tall, oaken doors carved with symbols of light and healing. This is the entrance to the temple.", 
                "verbs": ["ENTER"], 
                "target_room": "temple_of_light",
                "perception_dc": 0,
                "keywords": ["doors", "oaken doors", "temple"]
            }
        ]
    },
    
    {
        "room_id": "ts_west", 
        "name": "West Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the western part of the town square. The main square is to the east. A wide marble arch leads into the bank here."
        },
        "exits": {"east": "town_square", "north": "ts_northwest", "south": "ts_southwest"},
        "objects": [
            {
                "name": "arch", 
                "description": "A grand marble arch, polished and imposing, serving as the entrance to the bank.", 
                "verbs": ["ENTER"], 
                "target_room": "bank_lobby",
                "perception_dc": 0,
                "keywords": ["arch", "marble arch", "bank"]
            }
        ]
    },
    
    {
        "room_id": "ts_northeast", 
        "name": "Northeast Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the northeast corner of the town square. A small, rune-etched door is set into an alley here."
        },
        "exits": {"southwest": "town_square", "south": "ts_east", "west": "ts_north"},
        "objects": [
            {
                "name": "rune-etched door", 
                "description": "This door is barred by a faint, shimmering field of energy. A small plaque reads: 'Elementalist's Study. Apprentices only.'", 
                "verbs": ["ENTER"], 
                "target_room": "elementalist_study",
                "perception_dc": 0,
                "keywords": ["door", "rune-etched door", "study"]
            }
        ]
    },
    
    {
        "room_id": "ts_northwest", 
        "name": "Northwest Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the northwest corner of the town square. A solid oak door with an iron anvil sigil marks the armory."
        },
        "exits": {"southeast": "town_square", "south": "ts_west", "east": "ts_north"},
        "objects": [
            {
                "name": "door", 
                "description": "A heavy oak door with a sigil of an anvil and hammer. This is the town armory.", 
                "verbs": ["ENTER"], 
                "target_room": "armory_shop",
                "perception_dc": 0,
                "keywords": ["door", "oak door", "armory"]
            }
        ]
    },
    
    {
        "room_id": "ts_southeast", 
        "name": "Southeast Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the southeast corner of the town square."
        }, 
        "exits": {"northwest": "town_square", "north": "ts_east", "west": "ts_south"}
    },
    
    {
        "room_id": "ts_southwest", 
        "name": "Southwest Square", 
        "is_outdoor": true, 
        "description": {
            "default": "You are in the southwest corner of the town square. The door to a small furrier's shop is here, a crude sign of a pelt hanging above it."
        },
        "exits": {"northeast": "town_square", "north": "ts_west", "east": "ts_south"},
        "objects": [
            {
                "name": "door", 
                "description": "A simple wooden door under a sign of a stretched pelt. This appears to be the furrier.", 
                "verbs": ["ENTER"], 
                "target_room": "furrier_shop",
                "perception_dc": 0,
                "keywords": ["door", "wooden door", "furrier", "shop"]
            }
        ]
    },
    
    {
        "room_id": "inn_room",
        "name": "A Room at the Inn",
        "description": {
            "default": "You are in a simple, comfortable room... You feel as though you just woke from a long, hazy dream..."
        },
        "objects": [
            {"name": "bed", "description": "A simple straw mattress...", "perception_dc": 0, "keywords": ["bed", "mattress"]},
            {"name": "window", "description": "Looking out the window, you can see the bustling town square.", "perception_dc": 0, "keywords": ["window"]}
        ],
        "exits": { "out": "ts_south" } 
    },

    {
        "room_id": "furrier_shop",
        "name": "The Furrier's Shop",
        "description": {
            "default": "The small shop smells strongly of curing chemicals and animal musk. Pelts and claws of dubious origin are piled on a workbench. A grizzled furrier looks up as you enter."
        },
        "objects": [
            {
                "name": "furrier",
                "description": "A grizzled man skinning a small animal. He looks like he's seen better days.",
                "keywords": ["furrier", "man", "shopkeep"],
                "shop_data": {
                    "type": "furrier",
                    "inventory": [],
                    "will_buy": ["pelt_ruined", "monster_claw", "viridian_leaf", "althion_stem"]
                }
            }
        ],
        "exits": { "out": "ts_southwest" }
    },
    
    {
        "room_id": "bank_lobby",
        "name": "The Bank of MUD",
        "description": {
            "default": "You are in a grand lobby with a high, vaulted ceiling and a polished marble floor. A long counter of dark, polished wood dominates one wall."
        },
        "objects": [
            {
                "name": "teller",
                "description": "A sharply-dressed teller stands behind the counter, ready to assist you.",
                "keywords": ["teller", "banker"],
                "verbs": ["deposit", "withdraw", "balance", "look"]
            },
            {
                "name": "counter",
                "description": "A long, polished counter of dark wood.",
                "keywords": ["counter"]
            }
        ],
        "exits": { "out": "ts_west" }
    },
    
    {
        "room_id": "armory_shop",
        "name": "The Town Armory",
        "description": {
            "default": "The walls of this shop are lined with racks of basic weapons and armor. An armorer stands by a large anvil, wiping his brow."
        },
        "objects": [
            {
                "name": "armorer",
                "description": "A large, muscular man with soot on his face. He nods at you.",
                "keywords": ["armorer", "man", "shopkeep"],
                "shop_data": {
                    "type": "armory",
                    "inventory": [
                        "knuckle_dusters", "starter_dagger", "starter_short_sword", "starter_bastard_sword",
                        "starter_club", "starter_mace", "starter_greatclub", "starter_spear",
                        "starter_bow", "starter_crossbow", "starter_throwing_knife", "starter_javelin",
                        "starter_sling", "starter_staff", "starter_leather_armor", "starter_small_shield"
                    ],
                    "will_buy": [
                        "knuckle_dusters", "starter_dagger", "starter_short_sword", "starter_bastard_sword",
                        "starter_club", "starter_mace", "starter_greatclub", "starter_spear",
                        "starter_bow", "starter_crossbow", "starter_throwing_knife", "starter_javelin",
                        "starter_sling", "starter_staff", "starter_leather_armor", "starter_small_shield"
                    ]
                }
            }
        ],
        "exits": { "out": "ts_northwest" }
    },
    
    {
        "room_id": "temple_of_light",
        "name": "Temple of Light",
        "description": {
            "default": "A quiet, peaceful temple. Incense burns softly in the air, and sunlight streams through a high, stained-glass window, illuminating a stone altar in the center of the room. A robed priest tends to several hurt patrons on cots."
        },
        "objects": [
            {
                "name": "stone altar",
                "description": "A simple, flat altar of white stone. It feels cold to the touch. This is where you awaken if you are slain.",
                "keywords": ["altar", "stone altar"]
            },
            {
                "name": "priest",
                "description": "A kindly priest moves between cots, offering water and bandages. He looks tired and his supplies seem low. You could try to 'GIVE' him items or 'TALK TO' him.",
                "keywords": ["priest", "robed priest"],
                "quest_giver_ids": ["heal_quest_1", "priest_quest_2"],
                "all_quests_done_message": "The priest smiles warmly. 'You have learned all I can teach. Go with light, traveler.'"
            },
            {
                "name": "hurt patron",
                "description": "A citizen lying on a cot, groaning softly.",
                "keywords": ["patron", "hurt patron", "citizen"]
            }
        ],
        "exits": { "out": "ts_east" }
    },
    
    {
        "room_id": "elementalist_study",
        "name": "Elementalist's Study",
        "description": {
            "default": "This small study is filled with crackling energy. Books line the walls and strange contraptions hiss and spark on a workbench. A stern-looking elementalist watches you enter."
        },
        "objects": [
            {
                "name": "elementalist",
                "description": "A stern-looking elementalist with crackling energy around their fingertips. They seem focused on their research. You could try to 'GIVE' them items or 'TALK TO' them.",
                "keywords": ["elementalist", "trainer"],
                "quest_giver_ids": ["shock_quest_1", "elementalist_quest_2"],
                "all_quests_done_message": "The elementalist scoffs. 'I have no more time for apprentices. Be gone.'"
            }
        ],
        "exits": { "out": "ts_northeast" }
    },

    {
        "room_id": "north_gate",
        "name": "North Gate",
        "is_outdoor": true,
        "description": {
            "default": "A sturdy stone gatehouse marks the northern exit of the city. A path leads south back to the town square, and the gate opens to a forest path to the north. A town guardsman stands watch here."
        },
        "objects": [
            {
                "name": "a town guardsman",
                "description": "A guardsman in leather armor, holding a spear. He watches the northern path warily.",
                "verbs": ["look", "attack", "talk"],
                "is_monster": true,
                "monster_id": "town_guardsman"
            }
        ],
        "exits": {
            "south": "ts_north",
            "north": "forest_clearing_1"
        }
    },
    {
        "room_id": "forest_clearing_1",
        "name": "Forest Clearing",
        "is_outdoor": true,
        "description": {
            "default": "You are in a small clearing in the forest. The trees are dense and cast deep shadows. The path back to the city gate is to the south. A smaller path continues east."
        },
        "objects": [
            {
                "name": "an orc warrior",
                "description": "A brutish, green-skinned humanoid. It carries a crude club and snarls at your approach.",
                "verbs": ["look", "attack"],
                "is_monster": true,
                "monster_id": "orc_warrior"
            }
        ],
        "exits": {
            "south": "north_gate",
            "east": "forest_clearing_2"
        }
    },
    {
        "room_id": "forest_clearing_2",
        "name": "Deep Forest Clearing",
        "is_outdoor": true,
        "description": {
            "default": "You are deeper in the forest now. The clearing is overgrown, and you see signs of a crude camp. A path leads west."
        },
        "objects": [
            {
                "name": "an orc warrior",
                "description": "A brutish, green-skinned humanoid. It carries a crude club and snarls at your approach.",
                "verbs": ["look", "attack"],
                "is_monster": true,
                "monster_id": "orc_warrior"
            }
        ],
        "exits": {
            "west": "forest_clearing_1"
        }
    }
]